GITHungry/app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks"
---
    def index
        bookmarks = Bookmark.all

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["recipe_id", 121], ["created_at", "2020-11-12 06:07:43.351569"], ["updated_at", "2020-11-12 06:07:43.351569"]]
---
    def create
        user = User.first
        recipe = Recipe.find(params[:recipe_id])
        bookmark = Bookmark.new(user_id: user.id, recipe: recipe)
        if bookmark.save