GITHungry/app/controllers/recipes_controller.rb

    def create
        @recipe = Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("title", "ingredients", "instructions", "cuisine_type", "cooking_time", "servings", "created_at", "updated_at", "image", "rating") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
        find_recipe
        @recipe.update(recipe_params)
---
UPDATE "recipes" SET "rating" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["rating", 1], ["updated_at", "2020-11-12 15:26:29.646872"], ["id", 125]]

    def destroy
        recipes = Recipe.all
        @recipe = find_recipe
        if @recipe.destroy
---
SELECT "recipes".* FROM "recipes"
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 149]]

    def find_recipe
        @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 125], ["LIMIT", 1]]